aws/amazon-freertos/vendors/cypress/boards/CY8CKIT_062_WIFI_BT/ports/ota/aws_ota_pal.c
/*
 * Amazon FreeRTOS OTA PAL V1.0.0
 * Copyright (C) 2018 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://aws.amazon.com/freertos
 * http://www.FreeRTOS.org
 */

/**
 * @file aws_ota_pal.c
 * @brief Platform Abstraction layer for AWS OTA
 *
 * NOTE: This implementation will handle a single NSPE binary file (normal application) or
 *       a tarball which has a "components.json" describing the files contained therein
 *       "components.json" is generated during the build process and added to the tarball.
 *
 * NOTE: When using the tarball OTA file, you must use HTTP transport (not MQTT)
 *       When using HTTP transport, the AFRTOS system heap must be increased (300k seems to work well)
 *       see projects/cypress/<board>/mtb/<appname>/config_files/FreeRTOSConfig.h
 *       #define configTOTAL_HEAP_SIZE                      ( ( size_t ) ( 300 * 1024 ) )
 */

/* C Runtime includes. */
#include <stdlib.h>
#include <string.h>

/* Amazon FreeRTOS include. */
#include "FreeRTOS.h"
#include "FreeRTOSConfig.h"
#include "aws_iot_ota_pal.h"
#include "bootutil/bootutil.h"
#include "sysflash/sysflash.h"
#include "flash_map_backend/flash_map_backend.h"
#include "cy_pdl.h"
#include "aws_ota_codesigner_certificate.h"
#include "mbedtls/base64.h"
#include "mbedtls/sha256.h"
#include "iot_crypto.h"

/* For aws_tests support */
#include "aws_ota_agent_config.h"

/* Added for Flash Read */
#include "flash_map_backend/flash_map_backend.h"
#include "flash_qspi/flash_qspi.h"
#include "cy_smif_psoc6.h"

#include "untar.h"

/* define CY_TEST_APP_VERSION_IN_TAR to test application version in TAR archive at start of OTA image download
 * NOTE: This requires that the user set the version numbers in the header file and
 *          in the Makefile and that they match.
 *          APP_VERSION_MAJOR
 *          APP_VERSION_MINOR
 *          APP_VERSION_BUILD
 */
#ifdef CY_TEST_APP_VERSION_IN_TAR
#include "aws_application_version.h"
#endif

/* For tarball support */
/**
 * @brief Tarball support file types recognized in components.json file
 *
 * The file type in the tarball
 */
#define CY_FILE_TYPE_SPE        "SPE"       /**< Secure Programming Environment (TFM) code type               */
#define CY_FILE_TYPE_NSPE       "NSPE"      /**< Non-Secure Programming Environment (application) code type   */

/**
 * @brief File Signature Key
 *
 * The OTA signature algorithm we support on this platform.
 */
const char cOTA_JSON_FileSignatureKey[ OTA_FILE_SIG_KEY_STR_MAX_LENGTH ] = "sig-sha256-ecdsa";

/***********************************************************************
 *
 * defines
 *
 **********************************************************************/
static const char pcOTA_PAL_CERT_BEGIN[] = "-----BEGIN CERTIFICATE-----";
static const char pcOTA_PAL_CERT_END[] = "-----END CERTIFICATE-----";

/***********************************************************************
 *
 * Macros
 *
 **********************************************************************/

#if 1   /* Debugging macros */
/**
 * @brief Macro to print system context information
 */
#define PRINT_SYSTEM_CONTEXT_PTR()
/**
 * @brief Macro to print Boot swap type
 */
#define PRINT_BOOT_SWAP_TYPE( title, boot_type )
/**
 * @brief Macro to print eState value
 */
#define PRINT_eSTATE( title, eSTATE )
/**
 * @brief Macro to print PAL state
 */
#define PRINT_PAL_STATE( title, palState )
#else
#define PRINT_SYSTEM_CONTEXT_PTR()  configPRINTF(("   sys_ctx: %p\n", sys_ctx));

#define PRINT_BOOT_SWAP_TYPE( title, boot_type ) \
    configPRINTF( ( "%s:: boot_swap_type:%d (%s)\n", ((title == NULL)?"":title), \
             boot_type, ((boot_type == 0) ? "Unknown" :             \
              (boot_type == BOOT_SWAP_TYPE_NONE) ? "None" :         \
              (boot_type == BOOT_SWAP_TYPE_TEST) ? "Test" :         \
              (boot_type == BOOT_SWAP_TYPE_PERM) ? "Permanent" :    \
              (boot_type == BOOT_SWAP_TYPE_REVERT) ? "Revert" :     \
              (boot_type == BOOT_SWAP_TYPE_FAIL) ? "FAIL" :         \
              (boot_type == BOOT_SWAP_TYPE_PANIC) ? "PANIC !!" : "Bad State")   ) );

#define PRINT_eSTATE( title, state ) \
    configPRINTF( ( "%s::   Sys Image State: 0x%lx (%s) \n", ((title == NULL)?"":title), \
             state, ((state == eOTA_ImageState_Unknown) ? "Unknown" :  \
             (state == eOTA_ImageState_Testing) ? "Testing" :          \
             (state == eOTA_ImageState_Accepted) ? "Accepted" :        \
             (state == eOTA_ImageState_Rejected) ? "Rejected" :        \
             (state == eOTA_ImageState_Aborted) ? "Aborted" : "ERROR") ) );

#define PRINT_PAL_STATE( title, palState ) \
    configPRINTF( ( "%s::   PAL Image State: 0x%lx (%s) \n", ((title == NULL)?"":title), \
            palState, ((palState == eOTA_PAL_ImageState_Unknown) ? "Unknown" :  \
             (palState == eOTA_PAL_ImageState_PendingCommit) ? "Pending" :          \
             (palState == eOTA_PAL_ImageState_Valid) ? "Valid" :        \
             (palState == eOTA_PAL_ImageState_Invalid) ? "Invalid" : "ERROR") ) );

#endif  /* Debugging Macros */

/***********************************************************************
 *
 * Structures
 *
 **********************************************************************/

/***********************************************************************
 *
 * Variables
 *
 **********************************************************************/
/**
 * @brief Ptr to system context
 *
 * Keep track of system context between calls from the OTA Agent
 *
 */
const OTA_FileContext_t *sys_ctx;

/**
 * @brief Current OTA Image State
 *
 * Keep track of the state OTA Agent wants us to be in.
 */
static OTA_ImageState_t current_OTA_ImageState = eOTA_ImageState_Unknown;

/**
 * @brief Last time we ran a signature check
 *
 * Keep track of the last signature check value for prvPAL_SetPlatformImageState
 */
static OTA_Err_t last_signature_check;

/**
 * @brief FLASH write block
 * This is used if a block is < Block size to satisfy requirements
 * of flash_area_write()
 */
static uint8_t block_buffer[CY_FLASH_SIZEOF_ROW];
/***********************************************************************
 *
 * UNTAR variables
 *
 **********************************************************************/

/**
 * @brief Context structure for parsing the tar file
 */
cy_untar_context_t  ota_untar_context;

/**
 * @brief Flag to denote this is a tar file
 *
 * We use this flag on subsequent chunks of file to know how to handle the data
 */
int ota_is_tar_archive;

/**
 * @brief Signature Verification Context
 */
void        *pvSigVerifyContext = NULL;

/**
 * @brief Signature Certificate size
 */
uint32_t    ulSignerCertSize;

/**
 * @brief pointer to Signer Certificate
 */
u8          *pucSignerCert = NULL;

/***********************************************************************
 *
 * Functions
 *
 **********************************************************************/

/**
 * @brief Read the specified signer certificate from the filesystem into a local buffer.
 *
 * The allocated memory returned becomes the property of the caller who is responsible for freeing it.
 *
 * This function is called from prvPAL_CheckFileSignature(). It should be implemented if signature
 * verification is not offloaded to non-volatile memory io function.
 *
 * @param[in] pucCertName The file path of the certificate file.
 * @param[out] ulSignerCertSize The size of the certificate file read.
 *
 * @return A pointer to the signer certificate in the file system. NULL if the certificate cannot be read.
 * This returned pointer is the responsibility of the caller; if the memory is allocated the caller must free it.
 */
static uint8_t * prvPAL_ReadAndAssumeCertificate( const uint8_t * const pucCertName,
                                                  uint32_t * const ulSignerCertSize )
{
    uint8_t *pucCertEnd;
    uint8_t *pucDecodedCertificate;
    size_t ulDecodedCertificateSize;

    *ulSignerCertSize = sizeof(signingcredentialSIGNING_CERTIFICATE_PEM);
    /* Skip the "BEGIN CERTIFICATE" */
    uint8_t* pucCertBegin = (uint8_t *)strstr (signingcredentialSIGNING_CERTIFICATE_PEM, pcOTA_PAL_CERT_BEGIN);
    if (pucCertBegin == NULL)
    {
        configPRINTF( ( "%s() No Begin found for Certificate\n", __func__) );
        return NULL;
    }
    pucCertBegin += sizeof(pcOTA_PAL_CERT_BEGIN);

    /* Find the "END CERTIFICATE" */
    pucCertEnd =  (uint8_t *)strstr((char *)pucCertBegin, pcOTA_PAL_CERT_END);
    if (pucCertEnd == NULL)
    {
        configPRINTF( ( "%s() No END found for Certificate\n", __func__) );
        return NULL;
    }

    mbedtls_base64_decode(NULL, 0, &ulDecodedCertificateSize, pucCertBegin, pucCertEnd - pucCertBegin);
    pucDecodedCertificate = (uint8_t *) pvPortMalloc(ulDecodedCertificateSize);
    if (pucDecodedCertificate == NULL)
    {
        configPRINTF( ( "%s() Failed to decode the Certificate\n", __func__) );
        return NULL;
    }
    mbedtls_base64_decode(pucDecodedCertificate, ulDecodedCertificateSize, &ulDecodedCertificateSize, pucCertBegin, pucCertEnd - pucCertBegin);

    return pucDecodedCertificate;
}

/**
 * @brief erase the second slot to prepare for writing OTA'ed application
 *
 * @param   N/A
 *
 * @return   0 on success
 *          -1 on error
 */
static int eraseSlotTwo( void )
{
    const struct flash_area *fap;
    int image;

    /* MCUBLOOT_IMAGE_NUMBER == 2, will ewrae both Secondary slot 1 and 2 */
    for (image = 0; image < MCUBOOT_IMAGE_NUMBER; image++)
    {
        if (flash_area_open(FLASH_AREA_IMAGE_SECONDARY(image), &fap) != 0)
        {
            configPRINTF( ( "%s() flash_area_open(FLASH_AREA_IMAGE_SECONDARY(%d)) failed\n", __func__, image) );
            return -1;
        }

        if (flash_area_erase(fap, 0, fap->fa_size) != 0)
        {
            configPRINTF( ( "%s() flash_area_erase(fap, 0) (image:%d) failed\n", __func__, image) );
            return -1;
        }

        flash_area_close(fap);
    }
    return 0;
}

/**
 * @brief Write different sized chunks in 512 byte blocks
 *
 * @param fap           currently open Flash Area
 * @param offset        offset into the Flash Area to write data
 * @param source        data to use
 * @param size          amount of data in source to write
 *
 * return    0 == success
 *          -1 == error
 */
static int write_data_to_flash( const struct flash_area *fap,
        uint32_t offset,
        uint8_t * const source,
        uint32_t size)
{
    uint32_t bytes_to_write;
    uint32_t curr_offset;
    uint8_t *curr_src;

