aws/amazon-freertos/vendors/cypress/boards/CY8CKIT_062_WIFI_BT/ports/ota/aws_ota_pal.c
    bytes_to_write = size;
    curr_offset = offset;
    curr_src = source;

    while (bytes_to_write > 0)
    {
        uint32_t chunk_size = bytes_to_write;
        if (chunk_size > CY_FLASH_SIZEOF_ROW)
        {
            chunk_size = CY_FLASH_SIZEOF_ROW;
        }

        /* this should only happen on last part of last 4k chunk */
        if (chunk_size % CY_FLASH_SIZEOF_ROW)
        {
            /* we will read a 512 byte block, write out data into the block, then write the whole block */
            if (flash_area_read(fap, curr_offset, block_buffer, sizeof(block_buffer)) != 0)
            {
                configPRINTF( ( "%s() flash_area_read() failed\n", __func__) );
                return -1;
            }
            memcpy (block_buffer, curr_src, chunk_size);

            if (flash_area_write(fap, curr_offset, block_buffer, sizeof(block_buffer)) != 0)
            {
                configPRINTF( ( "%d:%s() flash_area_write() failed\n", __LINE__, __func__) );
                return -1;
            }

        }
        else
        {
            if (flash_area_write(fap, curr_offset, curr_src, chunk_size) != 0)
            {
                configPRINTF( ( "%d:%s() flash_area_write() failed\n", __LINE__, __func__) );
                return -1;
            }
        }

        curr_offset += chunk_size;
        curr_src += chunk_size;
        bytes_to_write -= chunk_size;
    }

    return 0;
}

/**
 * @brief callback to handle tar data
 *
 * @param ctxt          untar context
 * @param file_index    index into ctxt->files for the data
 * @param buffer        data to use
 * @param file_offset   offset into the file to store data
 * @param chunk_size    amount of data in buffer to use
 * @param cb_arg        argument passed into initialization
 *
 * return   CY_RSLT_SUCCESS
 *          CY_RSLT_TYPE_ERROR
 */
cy_untar_result_t ota_untar_write_callback(cy_untar_context_ptr ctxt,
                                   uint16_t file_index,
                                   uint8_t *buffer,
                                   uint32_t file_offset,
                                   uint32_t chunk_size,
                                   void *cb_arg)
{
    int image = 0;
    const struct flash_area *fap;
    OTA_FileContext_t * const C = (OTA_FileContext_t *)cb_arg;

    if ( (ctxt == NULL) || (buffer == NULL) || (C == NULL) )
    {
        return CY_UNTAR_ERROR;
    }

    if ( strncmp(ctxt->files[file_index].type, CY_FILE_TYPE_SPE, strlen(CY_FILE_TYPE_SPE)) == 0)
    {
        image = 1;  /* The TFM code, cm0 */
    }
    else if ( strncmp(ctxt->files[file_index].type, CY_FILE_TYPE_NSPE, strlen(CY_FILE_TYPE_NSPE)) == 0)
    {
        image = 0;  /* The application code, cm4 */
    }
    else
    {
        /* unknown file type */
//        configPRINTF( ("%d:%s BAD FILE TYPE : >%s<\n", __LINE__, __func__, ctxt->files[file_index].type) );
        return CY_UNTAR_ERROR;
    }

    if (flash_area_open(FLASH_AREA_IMAGE_SECONDARY(image), &fap) != 0)
    {
        configPRINTF( ( "%s() flash_area_open(%d) failed\n", __func__, image) );
        return CY_UNTAR_ERROR;
    }

    if (write_data_to_flash(fap, file_offset, buffer, chunk_size) != 0)
    {
        configPRINTF( ( "%s() write_data_to_flash() failed\n", __func__) );
        flash_area_close(fap);
        return CY_UNTAR_ERROR;
    }

    flash_area_close(fap);

    return CY_UNTAR_SUCCESS;
}

/**
 * @brief Initialization routine for handling tarball OTA file
 *
 * @param ctxt[in,out]  pointer to untar context to be initialized
 * @param C[in]         pointer to system OTA context
 *
 */
cy_rslt_t ota_untar_init_context( cy_untar_context_t* ctxt, OTA_FileContext_t * const C )
{
    if (cy_untar_init( ctxt, ota_untar_write_callback, (void *)C ) == CY_RSLT_SUCCESS)
    {
        ota_is_tar_archive  = 1;
        return CY_RSLT_SUCCESS;
    }
    return CY_RSLT_TYPE_ERROR;
}

/**
 * @brief - set pending for the files contained in the TAR archive we just validated.
 */
static int cy_ota_untar_set_pending(void)
{
    int i;
    int image = 0;
    for (i = 0; i < ota_untar_context.num_files_in_json; i++ )
    {
        if ( strncmp(ota_untar_context.files[i].type, CY_FILE_TYPE_SPE, strlen(CY_FILE_TYPE_SPE)) == 0)
        {
            image = 1;  /* The TFM code, cm0 */
        }
        else if ( strncmp(ota_untar_context.files[i].type, CY_FILE_TYPE_NSPE, strlen(CY_FILE_TYPE_NSPE)) == 0)
        {
            image = 0;  /* The application code, cm4 */
        }
        else
        {
            /* unknown file type */
            configPRINTF( ("%d:%s BAD FILE TYPE %d: >%s<\n", __LINE__, __func__, i, ota_untar_context.files[i].type) );
            continue;
        }
        boot_set_pending(image, 0);
    }

    return CY_UNTAR_SUCCESS;

}

/**
 * @brief De Initialize the signature checking data
 *
 */
static void prvPAL_FileSignatureCheckDeinit( void )
{
    pvSigVerifyContext = NULL;
    ulSignerCertSize = 0;
    if (pucSignerCert  != NULL)
    {
        vPortFree( pucSignerCert );
        pucSignerCert = NULL;
    }
}

/**
 * @brief Initialize the signature checking for tarball OTA
 *        We keep track of the interim values for subsequent WriteBlock calls.
 *
 * NOTE: This function is used for a tarball OTA file.
 *
 * This function is called from prvPAL_CreateFile().
 *
 * @param[in] C OTA file context information.
 *
 * @return Below are the valid return values for this function.
 * kOTA_Err_None if the signature verification passes.
 * kOTA_Err_SignatureCheckFailed if the signature verification fails.
 * kOTA_Err_BadSignerCert if the if the signature verification certificate cannot be read.
 */
static OTA_Err_t prvPAL_FileSignatureCheckInit( OTA_FileContext_t * const C )
{
    if ( C == NULL )
    {
        configPRINTF( ("%s() Bad Args C:%p\n", __func__, C) );
        return kOTA_Err_SignatureCheckFailed;
    }

    /* Reset globals for incremental sign check and handle re-entrant calls */
    prvPAL_FileSignatureCheckDeinit();

    /* Verify an ECDSA-SHA256 signature. */
    if( CRYPTO_SignatureVerificationStart( &pvSigVerifyContext, cryptoASYMMETRIC_ALGORITHM_ECDSA,
                                           cryptoHASH_ALGORITHM_SHA256 ) == pdFALSE )
    {
        configPRINTF( ( "%s() CRYPTO_SignatureVerificationStart() failed\n", __func__) );
        return kOTA_Err_SignatureCheckFailed;
    }

