aws/amazon-freertos/vendors/cypress/boards/CY8CKIT_062_WIFI_BT/ports/ota/aws_ota_pal.c
    if ( (C == NULL) || (C != sys_ctx ) || (C->lFileHandle == 0))
    {
        configPRINTF( ( "%s() BAD ARGS\n", __func__) );
        result = kOTA_Err_FileClose;
        goto _exit_CloseFile;
    }

    /* we got the data, try to verify it */
    if (C->pxSignature == NULL)
    {
        configPRINTF( ( "%s() No pxSignature from AWS\n", __func__) );
        result = kOTA_Err_SignatureCheckFailed;
        goto _exit_CloseFile;
    }

    /* For TAR files, we must use HTTP transport so that the file blocks come down
     * in sequential order - we need start of TAR (components.json) first, and we
     * do not store all of the blocks. Signature must be checked in sequential order.
     */
    if (ota_is_tar_archive == 1)
    {
        /* Do the final check for signature */
        if (prvPAL_FileSignatureCheckFinal(C) != kOTA_Err_None)
        {
            configPRINTF( ( "%s() TAR prvPAL_FileSignatureCheckFinal() failed\n", __func__) );
            eraseSlotTwo();
            result = kOTA_Err_SignatureCheckFailed;
        }
    }
    else
    {
        /* non-tar OTA, we downloaded a single file, might have been MQTT.
         * If MQTT, the file blocks may come in non-sequential order.
         * We need to run signature check across entire downloaded file at once.
         */
        const struct flash_area *fap;

        //configPRINTF( ( "%s() BINARY file, check whole file for signature\n", __func__) );
        fap = (const struct flash_area *)C->lFileHandle;
        if (fap == 0)
        {
            configPRINTF( ( "%s() ERROR: fap == NULL\n", __func__) );
            result = kOTA_Err_SignatureCheckFailed;
            goto _exit_CloseFile;
        }

        result = prvPAL_FileSignatureCheckInit( C );
        if (result == kOTA_Err_None)
        {
            uint32_t addr;
            addr = 0;
            while (addr < C->ulFileSize)
            {
                uint32_t toread = C->ulFileSize - addr;
                /* Re-use coalesce buffer as we have completed download (it is not used for non-TAR OTA) */
                if (toread > sizeof(ota_untar_context.coalesce_buffer) )
                    toread = sizeof(ota_untar_context.coalesce_buffer);

                if (flash_area_read(fap, addr, ota_untar_context.coalesce_buffer, toread) < 0)
                {
                    configPRINTF( ( "%s() flash_area_read() failed for signature check\r\n", __func__) );
                    result = kOTA_Err_SignatureCheckFailed;
                    goto _exit_CloseFile;
                }

                CRYPTO_SignatureVerificationUpdate( pvSigVerifyContext, ota_untar_context.coalesce_buffer, toread);

                addr += toread;
            }
            if (prvPAL_FileSignatureCheckFinal(C) != kOTA_Err_None)
            {
                configPRINTF( ( "%s() BIN prvPAL_FileSignatureCheckFinal() failed\n", __func__) );
                eraseSlotTwo();
                result = kOTA_Err_SignatureCheckFailed;
            }
        }
    }

_exit_CloseFile:

    if ( C != NULL && C->lFileHandle != 0 )
    {
        const struct flash_area *fap;
        fap = (const struct flash_area *)C->lFileHandle;
        flash_area_close(fap);
    }

    /* Free the signer certificate that we now own after prvReadAndAssumeCertificate(). */
    prvPAL_FileSignatureCheckDeinit();

    if (result != kOTA_Err_None)
    {
        current_OTA_ImageState = eOTA_ImageState_Unknown;
    }
    return result;
}

/**
 * @brief Write a block of data to the specified file at the given offset.
 *
 * @note The input OTA_FileContext_t C is checked for NULL by the OTA agent before this
 * function is called.
 * The file pointer/handle C->pucFile, is checked for NULL by the OTA agent before this
 * function is called.
 * pcData is checked for NULL by the OTA agent before this function is called.
 * ulBlockSize is validated for range by the OTA agent before this function is called.
 * ulBlockIndex is validated by the OTA agent before this function is called.
 *
 * @param[in] C OTA file context information.
 * @param[in] ulOffset Byte offset to write to from the beginning of the file.
 * @param[in] pcData Pointer to the byte array of data to write.
 * @param[in] ulBlockSize The number of bytes to write.
 *
 * @return The number of bytes written on a success, or a negative error code from the platform abstraction layer.
 */

int16_t prvPAL_WriteBlock( OTA_FileContext_t * const C,
                           uint32_t ulOffset,
                           uint8_t * const pcData,
                           uint32_t ulBlockSize )
{

    if ( (C == NULL) || (C != sys_ctx ) )
    {
        configPRINTF( ( "%s() BAD ARGS\n", __func__ ) );
        return -1;
    }

    /* we need to check some things when we receive the first block */
    if (ulOffset == 0UL)
    {

        /*
         * initialize file signature checking
         */
        if (prvPAL_FileSignatureCheckInit(C) != kOTA_Err_None)
        {
            configPRINTF( ( "%s() prvPAL_FileSignatureCheckInit() FAILED\n", __func__ ) );
            return -1;
        }

        /*
         * Check for incoming tarball (as opposed to a single file OTA)
         */
        if (cy_is_tar_header( pcData, ulBlockSize) == CY_UNTAR_SUCCESS)
        {
            if (ota_untar_init_context(&ota_untar_context, C) != CY_RSLT_SUCCESS)
            {
                configPRINTF( ( "%s() ota_untar_init_context() FAILED! \n", __func__) );
                return -1;
            }
        }
    }

    /* treat a tar file differently from a "normal" OTA */
    if (ota_is_tar_archive != 0)
    {
        uint32_t consumed = 0;

        /* check the signature incrementally over every block received */
        if (prvPAL_FileSignatureCheckStep( C, pcData, ulBlockSize) != kOTA_Err_None)
        {
            configPRINTF( ( "%s() FileSignatureCheckStep() offset:%ld FAILED!\n", __func__, ulOffset) );
            return -1;
        }

        while( consumed < ulBlockSize )
        {
            cy_untar_result_t result;
            result = cy_untar_parse(&ota_untar_context, (ulOffset + consumed), &pcData[consumed], (ulBlockSize- consumed), &consumed);
            if ( (result == CY_UNTAR_ERROR) || (result == CY_UNTAR_INVALID))
            {
                configPRINTF( ( "%s() cy_untar_parse() FAIL consumed: %ld sz:%ld result:%ld)!\n", __func__, consumed, ulBlockSize, result) );
                return -1;
            }
            /* Yield for a bit */
            vTaskDelay(1);
        }

        /* with the tarball we get a version - check if it is > current so we can bail early */
#ifdef CY_TEST_APP_VERSION_IN_TAR
        if (ota_untar_context.version[0] != 0)
        {
            /* example version string "<major>.<minor>.<build>" */
            uint16_t major = 0;
            uint16_t minor = 0;
            uint16_t build = 0;
            char *dot;
            major = atoi(ota_untar_context.version);
            dot = strstr(ota_untar_context.version, ".");
            if (dot != NULL)
            {
                dot++;
                minor = atoi(dot);
                dot = strstr(dot, ".");
                if (dot != NULL)
                {
                    dot++;
                    build = atoi(dot);

