aws/amazon-freertos/vendors/cypress/boards/CY8CKIT_062_WIFI_BT/ports/ota/aws_ota_pal.c
                    if ( (major < APP_VERSION_MAJOR) ||
                          ( (major == APP_VERSION_MAJOR) &&
                            (minor < APP_VERSION_MINOR)) ||
                          ( (major == APP_VERSION_MAJOR) &&
                            (minor == APP_VERSION_MINOR) &&
                            (build <= APP_VERSION_BUILD)))
                     {
                         configPRINTF( ( "%s() OTA image version %d.%d.%d <= current %d.%d.%d-- bail!\r\n", __func__,
                                 major, minor, build,
                                 APP_VERSION_MAJOR, APP_VERSION_MINOR, APP_VERSION_BUILD) );

                         return -1;
                     }
                }
            }
        }
#endif  /* CY_TEST_APP_VERSION_IN_TAR */
    }
    else
    {
        /* non-tarball OTA here */
        const struct flash_area *fap;
        fap = (const struct flash_area *)C->lFileHandle;
        if (fap == NULL)
        {
            configPRINTF( ( "%s() flash_area_pointer is NULL\n", __func__) );
            return -1;
        }

        if (write_data_to_flash( fap, ulOffset, pcData, ulBlockSize) == -1)
        {
            return -1;
        }
    }
    return ulBlockSize;
}

/**
 * @brief Activate the newest MCU image received via OTA.
 *
 * This function shall do whatever is necessary to activate the newest MCU
 * firmware received via OTA. It is typically just a reset of the device.
 *
 * @note This function SHOULD not return. If it does, the platform doesn't support
 * an automatic reset or an error occurred.
 *
 * @return The OTA PAL layer error code combined with the MCU specific error code. See OTA Agent
 * error codes information in aws_ota_agent.h.
 */
OTA_Err_t prvPAL_ActivateNewImage( void )
{
    configPRINTF( ("%s() \n", __func__) );
    /* Mark this new OTA image as pending, it will be the permanent
    * bootable image going forward.
    */
    if ( (ota_is_tar_archive != 0) && (ota_untar_context.magic == CY_UNTAR_CONTEXT_MAGIC) )
    {
        configPRINTF( ("%s() TAR prvPAL_FileSignatureCheckFinal() GOOD\n", __func__) );
        cy_ota_untar_set_pending();
    }
    else
    {
        /* Mark this new OTA image as pending, it will be the permanent
        * bootable image going forward.
        */
        configPRINTF( ("%s() BIN prvPAL_FileSignatureCheckFinal() GOOD\n", __func__) );
        /* Non-tar only has type 0 (NSPE) update */
        boot_set_pending(0, 0);
    }
    prvPAL_ResetDevice();
    return kOTA_Err_None;
}

/**
 * @brief Reset the device.
 *
 * This function shall reset the MCU and cause a reboot of the system.
 *
 * @note This function SHOULD not return. If it does, the platform doesn't support
 * an automatic reset or an error occurred.
 *
 * @return The OTA PAL layer error code combined with the MCU specific error code. See OTA Agent
 * error codes information in aws_ota_agent.h.
 */
OTA_Err_t prvPAL_ResetDevice( void )
{
    /* we want to wait a bit when in DEBUG builds so the logging mechanism can finish before resetting */
    vTaskDelay(pdMS_TO_TICKS( 1000UL ));
    configPRINTF( ("%s()   RESETTING NOW !!!!\n", __func__) );
    vTaskDelay(pdMS_TO_TICKS( 1000UL ));
    NVIC_SystemReset();
    return kOTA_Err_None;
}

/**
 * @brief Attempt to set the state of the OTA update image.
 *
 * Do whatever is required by the platform to Accept/Reject the OTA update image (or bundle).
 * Refer to the PAL implementation to determine what happens on your platform.
 *
 * @param[in] eState The desired state of the OTA update image.
 *
 * @return The OTA_Err_t error code combined with the MCU specific error code. See aws_ota_agent.h for
 *         OTA major error codes and your specific PAL implementation for the sub error code.
 *
 * Major error codes returned are:
 *
 *   kOTA_Err_None on success.
 *   kOTA_Err_BadImageState: if you specify an invalid OTA_ImageState_t. No sub error code.
 *   kOTA_Err_AbortFailed: failed to roll back the update image as requested by eOTA_ImageState_Aborted.
 *   kOTA_Err_RejectFailed: failed to roll back the update image as requested by eOTA_ImageState_Rejected.
 *   kOTA_Err_CommitFailed: failed to make the update image permanent as requested by eOTA_ImageState_Accepted.
 *
 *
 *   IMPORTANT NOTES:
 *
 *   Our implementation checks the signature on the call to prvPAL_CloseFile().
 *   We assume that if the updated app is running in slot 0 that it is acceptable.
 *
 *   if prvPAL_SetPlatformImageState() is called and the sys_ctx is NULL, we are not in the process of downloading a new image.
 *      if the eState is Rejected or Aborted, it pertains to the in-process download (or invalid job) for Secondary Slot.
 *      We could erase the secondary slot, but we do that each new download start, and will not consider new download OK if not complete.
 *
 */
OTA_Err_t prvPAL_SetPlatformImageState( OTA_ImageState_t eState )
{
    OTA_Err_t   result = kOTA_Err_None;

    PRINT_eSTATE( "-------------------------> prvPAL_SetPlatformImageState() curr eState:", current_OTA_ImageState);
    PRINT_eSTATE( "-------------------------> prvPAL_SetPlatformImageState() new  eSTATE:", eState);
    PRINT_SYSTEM_CONTEXT_PTR();
    PRINT_BOOT_SWAP_TYPE(NULL, boot_swap_type());

    if( eState == eOTA_ImageState_Unknown || eState > eOTA_LastImageState )
    {
        return kOTA_Err_BadImageState;
    }

    if (sys_ctx == NULL)
    {
        /* We are not currently loading an OTA image. This state change pertains to Slot 0 image */
        switch (eState)
        {
        case eOTA_ImageState_Accepted:
            /* Mark Slot 0 image as valid */
            // We need to know if the last check was good...
            if (last_signature_check == kOTA_Err_None)
            {
                boot_set_confirmed();
                configPRINTF( ("%s() Set confirmed()\n", __func__) );
            }
            else
            {
                result = kOTA_Err_CommitFailed;
            }
            break;
        case eOTA_ImageState_Rejected:
            /* we haven't closed the file, and the OTA Agent has rejected the download */
            result = kOTA_Err_None;
            break;
        case eOTA_ImageState_Aborted:
            /* We are not actively downloading, this pertains to an invalid download job
             * or an aborted job. We erase secondary slot when we start a new download,
             * and do not consider secondary slot ready unless download completes and
             * signature checked. nothing to do here, but set our state to Accepted so
             * we store it for GetImageState().
             */
            eState = eOTA_ImageState_Accepted;
            break;
        case eOTA_ImageState_Testing:
            break;
        default:
            result = kOTA_Err_BadImageState;
            break;
        }
    }
    else
    {
        /* We are in the middle of a new download
         * Abort or Reject refers to the new download, not the primary slot.
         * Nothing to do here.
         */
        if (eState == eOTA_ImageState_Accepted)
        {
            if (sys_ctx->lFileHandle != (uint32_t)NULL)
            {
                result = kOTA_Err_CommitFailed;
            }
        }
    }

    /* keep track of the state OTA Agent sent. */
    current_OTA_ImageState = eState;

    PRINT_BOOT_SWAP_TYPE(NULL, boot_type);
    PRINT_eSTATE( "-------------------------> prvPAL_SetPlatformImageState() current  eSTATE:", eState);
    PRINT_SYSTEM_CONTEXT_PTR();
    PRINT_BOOT_SWAP_TYPE(NULL, boot_type);

    return result;
}


/**
 * @brief Get the state of the OTA update image.
 *
 * We read this at OTA_Init time and when the latest OTA job reports itself in self
 * test. If the update image is in the "pending commit" state, we start a self test
 * timer to assure that we can successfully connect to the OTA services and accept
 * the OTA update image within a reasonable amount of time (user configurable). If
 * we don't satisfy that requirement, we assume there is something wrong with the
 * firmware and automatically reset the device, causing it to roll back to the
 * previously known working code.
 *
 * If the update image state is not in "pending commit," the self test timer is
 * not started.
 *
 * @return An OTA_PAL_ImageState_t. One of the following:
 *   eOTA_PAL_ImageState_PendingCommit (the new firmware image is in the self test phase)
 *   eOTA_PAL_ImageState_Valid         (the new firmware image is already committed)
 *   eOTA_PAL_ImageState_Invalid       (the new firmware image is invalid or non-existent)
 *
 *   NOTE: eOTA_PAL_ImageState_Unknown should NEVER be returned and indicates an implementation error.
 *
 * We are testing the New application.
 * BOOT_SWAP_TYPE_NONE     1
 * BOOT_SWAP_TYPE_TEST     2    Swap to the secondary slot. Absent a confirm command (STDE - Valid?), revert back on next boot.
 * BOOT_SWAP_TYPE_PERM     3    Swap to the secondary slot, and permanently switch to booting its contents.
 * BOOT_SWAP_TYPE_REVERT   4    Swap back to alternate slot.  A confirm (STDE - Valid?) changes this state to NONE.
 * BOOT_SWAP_TYPE_FAIL     5    Swap failed because image to be run is not valid
 * BOOT_SWAP_TYPE_PANIC    0xff Swapping encountered an unrecoverable error
 */

OTA_PAL_ImageState_t prvPAL_GetPlatformImageState( void )
{
    OTA_PAL_ImageState_t result = eOTA_PAL_ImageState_Unknown;

    PRINT_eSTATE(  "<------------------------- prvPAL_GetPlatformImageState() current  eSTATE:", current_OTA_ImageState);
    PRINT_SYSTEM_CONTEXT_PTR();
    PRINT_BOOT_SWAP_TYPE(NULL, boot_swap_type());

    /**
     * After swap/copy of secondary slot to primary slot, boot_swap_type() returns NONE.
     * It does not reflect the fact we may be in self-test mode.
     * Use the saved value from SetImageState() to report our status.
     */
    if (current_OTA_ImageState == eOTA_ImageState_Testing)
    {
        /* in self-test, report Pending. */
        result = eOTA_PAL_ImageState_PendingCommit;
    }
    else if ( (current_OTA_ImageState == eOTA_ImageState_Rejected ) ||
              (current_OTA_ImageState == eOTA_ImageState_Aborted ) )
    {
        result = eOTA_PAL_ImageState_Invalid;
    }
    else if (current_OTA_ImageState == eOTA_ImageState_Accepted)
    {
        result = eOTA_PAL_ImageState_Valid;
    }
    else
    {
        //result = eOTA_PAL_ImageState_Valid;
        result = eOTA_ImageState_Unknown;
    }

    PRINT_PAL_STATE( "<------------------------- prvPAL_GetPlatformImageState() DONE: ", result);
    return result;
}

/*-----------------------------------------------------------*/

/* Provide access to private members for testing. */
#ifdef AMAZON_FREERTOS_ENABLE_UNIT_TESTS
    #include "aws_ota_pal_test_access_define.h"
#endif
